In [15]:
import pandas as pd

In [16]:
dataset = pd.read_csv("\DS\Pandas\Files\employees.csv")
dataset.head()

      Name   Age   Salary Department
0    Alice  30.0  50000.0         HR
1      Bob   NaN  55000.0         IT
2  Charlie  25.0      NaN    Finance
3    David  35.0  70000.0         IT
4      Eve  28.0  62000.0        NaN

In [17]:
dataset.columns

Index(['Name', 'Age', 'Salary', 'Department'], dtype='object')

In [18]:
dataset.isnull().mean()*100

Name           0.0
Age           20.0
Salary        20.0
Department    20.0
dtype: float64

In [19]:
dataset.describe()

             Age       Salary
count   4.000000      4.00000
mean   29.500000  59250.00000
std     4.203173   8693.86757
min    25.000000  50000.00000
25%    27.250000  53750.00000
50%    29.000000  58500.00000
75%    31.250000  64000.00000
max    35.000000  70000.00000

In [20]:
dataset.nunique()

Name          5
Age           4
Salary        4
Department    3
dtype: int64

In [21]:
dataset.drop_duplicates()

      Name   Age   Salary Department
0    Alice  30.0  50000.0         HR
1      Bob   NaN  55000.0         IT
2  Charlie  25.0      NaN    Finance
3    David  35.0  70000.0         IT
4      Eve  28.0  62000.0        NaN

In [22]:
dataset.dropna(how="all")

      Name   Age   Salary Department
0    Alice  30.0  50000.0         HR
1      Bob   NaN  55000.0         IT
2  Charlie  25.0      NaN    Finance
3    David  35.0  70000.0         IT
4      Eve  28.0  62000.0        NaN

In [23]:
dataset["Age"] = dataset["Age"].fillna(dataset["Age"].mean())
dataset["Salary"] = dataset["Salary"].fillna(dataset["Salary"].mean())
dataset["Department"] = dataset["Department"].fillna(dataset["Department"].mode()[0])
dataset

      Name   Age   Salary Department
0    Alice  30.0  50000.0         HR
1      Bob  29.5  55000.0         IT
2  Charlie  25.0  59250.0    Finance
3    David  35.0  70000.0         IT
4      Eve  28.0  62000.0         IT

In [24]:
dataset["Department"].value_counts()

Department
IT         3
HR         1
Finance    1
Name: count, dtype: int64

In [25]:
dataset[["Age","Salary"]].corr()

             Age    Salary
Age     1.000000  0.459519
Salary  0.459519  1.000000

In [28]:
sv = dataset.groupby(dataset["Salary"].mean())
# sv.get_group()

KeyError: np.float64(59250.0)

In [ ]:
dataset.to_csv("D:\DS\Vizualization\employees.csv",index=False)